nc: 1  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

ch: 6

# YOLOv8 backbone
backbone:
  # [from, number, module, args]
    - [-1, 1, Silence, []] # 0: Original 6-channel input

    - [0, 1, SilenceChannel, [0, 3]] # 1: Extract first 3 channels
    - [-1, 1, Conv, [64, 6, 2, 2]] # 2-P1/2
    - [-1, 1, Conv, [128, 3, 2]] # 3-P2/4
    - [-1, 3, C2f, [128, True]]
    - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8
    - [-1, 6, C2f, [256, True]]
    - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
    - [-1, 9, C2f, [512, True]]
    - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
    - [-1, 3, C2f, [1024, True]]
    - [-1, 1, SPPF, [1024, 5]] # 11

    - [0, 1, SilenceChannel, [3, 6]] # 12: Extract last 3 channels
    - [-1, 1, Conv, [64, 6, 2, 2]] # 13
    - [-1, 1, Conv, [128, 3, 2]] # 14
    - [-1, 3, C2f, [128, True]] # 15
    - [-1, 1, Conv, [256, 3, 2]] # 16
    - [-1, 6, C2f, [256, True]] # 17
    - [-1, 1, Conv, [512, 3, 2]] # 18
    - [-1, 9, C2f, [512, True]] # 19
    - [-1, 1, Conv, [1024, 3, 2]] # 20
    - [-1, 3, C2f, [1024, True]] # 21
    - [-1, 1, SPPF, [1024, 5]] # 22

    - [[11, 22], 1, FusionMamba, [1024, 8, 8]] # 23
    - [[-1, 11, 22], 1, FourInputFusionBlock,  [512]] # 24

# YOLOv8 head
head: 
    # [[9, 19], 1, Concat, [1]], # 
    - [-1, 1, Conv, [512, 1, 1]]  # 
    - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  #
    - [[-1, 8, 19], 1, Concat, [1]] # 
    - [-1, 3, C2f, [512, False]] # 28

    - [-1, 1, Conv, [256, 1, 1]] # 
    - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 
    - [[-1, 6, 17], 1, Concat, [1]] # cat backbone P3 
    - [-1, 3, C2f, [256, False]] #  (P3/8-small) 32

    - [-1, 1, Conv, [256, 3, 2]] # 
    # [[-1, 25], 1, Concat, [1]], # cat head P4 
    - [[-1, 29], 1, Concat, [1]] # cat head P4 
    - [-1, 3, C2f, [512, False]] #  (P4/16-medium) 35

    - [-1, 1, Conv, [512, 3, 2]] # 
    - [[-1, 24], 1, Concat, [1]] # cat head P5 
    - [-1, 3, C2f, [1024, False]] # (P5/32-large) # 38

    - [[32, 35, 38], 1, Detect, [nc]] # Detect(P3, P4, P5)
